In [2]:
import pandas as pd
import numpy as np

In [4]:
sch = pd.read_csv("C:/Users/miles.MILE-BL-4766-LA.000/Documents/FT/airline_data/tbl_schedule_2.csv")
sch.head()

   Unnamed: 0 ord_airport dest_airport depart_time arr_time        day
0           0         BTR          ATL        7:27     9:57  2023-02-2
1           1         BTR          ATL        8:28    10:46  2023-02-2
2           2         BTR          IAH       16:49    18:01  2023-02-2
3           3         BTR          DFW       17:47    19:19  2023-02-2
4           4         BTR          IAH       11:39    13:04  2023-02-2

In [9]:
status = ('Scheduled','Delayed','Departed','In Air',
 'Expected','Diverted','Recovery','Landed',
 'Arrived','Cancelled','No Takeoff','PastÂ Flight')

In [13]:
# sch.shape
flight_call = [i for i in range(1,5191)]
sch_id = list(sch['Unnamed: 0'])
sts = ['']*5190

flight_tbl = pd.DataFrame({'flight_call':flight_call, 'schedule_id':sch_id, 'status':sts})
flight_tbl.head()

   flight_call  schedule_id status
0            1            0
1            2            1
2            3            2
3            4            3
4            5            4

In [15]:
flight_tbl.to_csv("C:/Users/miles.MILE-BL-4766-LA.000/Documents/FT/airline_data/tbl_flights.csv")

In [16]:
flight_tbl.shape

(5190, 3)

In [ ]:
for i in range(1,24):